[
    {
        "term": "A-frame",
        "definition": "A wave that breaks evenly on both sides, forming a peak in the center, resembling the shape of an ‘A’."
    },
    {
        "term": "Aggro",
        "definition": "An Australian expression for aggressive surfing or aggressive surfer."
    },
    {
        "term": "Alaia",
        "definition": "A wooden surfboard originally used by Hawaiians in the late 19th century."
    },
    {
        "term": "Aloha",
        "definition": "A Hawaiian greeting that means “hello” or “goodbye”."
    },
    {
        "term": "Amped",
        "definition": "Excited or stoked before, during, or after a surf session."
    },
    {
        "term": "Backdoor",
        "definition": "When a surfer pulls into a hollow section from behind the section."
    },
    {
        "term": "Backside",
        "definition": "When a surfer rides with their back to the wave."
    },
    {
        "term": "Backwash",
        "definition": "The water that flows back into the ocean after a wave breaks onshore, often disrupting incoming waves."
    },
    {
        "term": "Bail",
        "definition": "An evasive maneuver activated when a surfer is caught inside or when they are about to wipe out."
    },
    {
        "term": "Bailing",
        "definition": "Letting go of your surfboard."
    },
    {
        "term": "Bank",
        "definition": "A sandbank."
    },
    {
        "term": "Barrel",
        "definition": "The hollow part of a wave where a surfer can ride inside the curl of the wave, also known as the tube."
    },
    {
        "term": "Bathymetry",
        "definition": "The measurement of water depths in oceans and seas."
    },
    {
        "term": "Beach Break",
        "definition": "Waves that break over sandbars."
    },
    {
        "term": "Beach Bum",
        "definition": "Someone, usually a surfer, who hangs around the beach."
    },
    {
        "term": "Bellyboard",
        "definition": "A bodyboard used to ride waves in a prone position."
    },
    {
        "term": "Blank",
        "definition": "A rough block of polyurethane foam that will be transformed into a surfboard."
    },
    {
        "term": "Bodysurf",
        "definition": "The sport of riding waves using only the body and swim fins."
    },
    {
        "term": "Bogging",
        "definition": "When a surfer’s weight is too far back, causing the surfboard’s nose to lift up."
    },
    {
        "term": "Bombora",
        "definition": "A deepwater offshore reef break."
    },
    {
        "term": "Booger",
        "definition": "A bodyboarder."
    },
    {
        "term": "Bottom Turn",
        "definition": "When a surfer turns at the bottom of the wave to start trimming the optimal surf line."
    },
    {
        "term": "Bro",
        "definition": "Brother, mate."
    },
    {
        "term": "Burn",
        "definition": "To drop in on someone or steal a wave from another surfer without priority."
    },
    {
        "term": "Carve",
        "definition": "A sharp turn on the wave face."
    },
    {
        "term": "Caught Inside",
        "definition": "When a surfer is too close to the beach in the impact zone."
    },
    {
        "term": "Chandelier",
        "definition": "Water falling at a barrel opening, threatening the tube rider."
    },
    {
        "term": "Charging",
        "definition": "When a surfer is giving it all and putting on a show – 'he’s charging!'"
    },
    {
        "term": "Chop",
        "definition": "Bumpy ocean and wave conditions due to strong winds and/or currents."
    },
    {
        "term": "Choppy",
        "definition": "When the ocean surface is rough and bumpy due to strong winds or cross swells."
    },
    {
        "term": "Cleanup Set",
        "definition": "A set of powerful waves that clears the lineup."
    },
    {
        "term": "Closeout",
        "definition": "When a wave breaks all at once along its length, making it impossible to ride."
    },
    {
        "term": "Corduroy",
        "definition": "The vision of a series of swells marching in from the horizon."
    },
    {
        "term": "Crest",
        "definition": "The top and highest point of a wave."
    },
    {
        "term": "Cross Step",
        "definition": "A footwork technique that allows surfers to walk up and down the surfboard."
    },
    {
        "term": "Cutback",
        "definition": "A turn performed on the flats or in the shoulder of the wave to get back to the power zone."
    },
    {
        "term": "Dawn Patrol",
        "definition": "Surfing at sunrise to catch uncrowded waves and favorable conditions."
    },
    {
        "term": "Deck",
        "definition": "The top of the surfboard."
    },
    {
        "term": "Ding",
        "definition": "A crack, hole, or fracture in a surfboard."
    },
    {
        "term": "Doggy Door",
        "definition": "The small exit hole a surfer uses to get out of the barrel."
    },
    {
        "term": "Drop",
        "definition": "The moment after paddling in and standing up, just before the first turn on the wave face."
    },
    {
        "term": "Drop-in",
        "definition": "To catch a wave that someone else is already riding, considered bad etiquette."
    },
    {
        "term": "Duck Diving",
        "definition": "The technique of pushing the surfboard under and through a breaking wave."
    },
    {
        "term": "Dude",
        "definition": "A cool person, surfer, or skateboarder."
    },
    {
        "term": "Epoxy",
        "definition": "A type of plastic resin used to produce surfboards."
    },
    {
        "term": "Eskimo Roll",
        "definition": "A technique used by surfers on longboards to roll under a breaking wave by flipping the board over and holding on tightly."
    },
    {
        "term": "Fetch",
        "definition": "The uninterrupted distance over which the wind blows without a significant change in direction."
    },
    {
        "term": "Fin",
        "definition": "A hydrofoil mounted at the tail of a surfboard to improve directional stability and control through foot-steering."
    },
    {
        "term": "Firing",
        "definition": "Amazing and spectacular wave conditions."
    },
    {
        "term": "Flat",
        "definition": "When there are no surfable waves, and the ocean surface is calm."
    },
    {
        "term": "Flats",
        "definition": "The horizontal part of a breaking wave, also known as the shoulder."
    },
    {
        "term": "Flippers",
        "definition": "Swim fins."
    },
    {
        "term": "Floater",
        "definition": "A surfing maneuver where the rider goes over the top of a crumbling section and ends up in the flats."
    },
    {
        "term": "Foam",
        "definition": "Whitewater."
    },
    {
        "term": "Foam Board",
        "definition": "A soft-top surfboard made of foam, ideal for beginners."
    },
    {
        "term": "Foam Blank",
        "definition": "The block of foam from which a surfboard is shaped."
    },
    {
        "term": "Frontside",
        "definition": "When a surfer rides facing the wave."
    },
    {
        "term": "Froth",
        "definition": "Stoked, amped, or excited."
    },
    {
        "term": "Fullsuit",
        "definition": "A complete neoprene wetsuit."
    },
    {
        "term": "Funboard",
        "definition": "A mid-length surfboard, also known as Malibu or minimal."
    },
    {
        "term": "Glass Off",
        "definition": "When the wind stops blowing, and the ocean becomes smooth and glassy, often occurring in the evening."
    },
    {
        "term": "Glassy",
        "definition": "Perfect wave conditions with a smooth ocean surface."
    },
    {
        "term": "Green Wave",
        "definition": "An unbroken wave that is ideal for riding."
    },
    {
        "term": "Grind",
        "definition": "The sound of the fins or rail of the surfboard scraping along the wave face."
    },
    {
        "term": "Hanging 10",
        "definition": "A longboard maneuver where the surfer walks to the nose and hangs all 10 toes off the edge."
    },
    {
        "term": "Hard Turn",
        "definition": "A sharp turn on the wave face, often at high speed."
    },
    {
        "term": "Hollow",
        "definition": "A wave that breaks in a barrel shape, creating a deep, steep hollow."
    },
    {
        "term": "Hot Dogging",
        "definition": "Performing difficult and stylish maneuvers on the wave."
    },
    {
        "term": "Indo",
        "definition": "Short for Indonesia, a popular surf destination known for its perfect waves."
    },
    {
        "term": "Inside",
        "definition": "The portion of the wave closest to the shore."
    },
    {
        "term": "Kook",
        "definition": "A surfer who is inexperienced or lacks skill, often used pejoratively."
    },
    {
        "term": "Leash",
        "definition": "The cord that attaches a surfboard to the surfer"
    },
    {
        "term": "Leg rope",
        "definition": "Another term for leash"
    },
    {
        "term": "Line-up",
        "definition": "The spot in the ocean where surfers line up to catch waves, just behind the breaking zone"
    },
    {
        "term": "Lip",
        "definition": "The curling part of a wave"
    },
    {
        "term": "Localism",
        "definition": "Aggressive territorial protection of a surf spot by local surfers"
    },
    {
        "term": "Log",
        "definition": "Another word for longboard"
    },
    {
        "term": "Longboard",
        "definition": "The longest surfboard"
    },
    {
        "term": "Lull",
        "definition": "The time between sets of waves with no waves breaking"
    },
    {
        "term": "Mack",
        "definition": "Big"
    },
    {
        "term": "Mental",
        "definition": "Crazy or radical"
    },
    {
        "term": "Mushburger",
        "definition": "A slow and fat wave"
    },
    {
        "term": "Mysto spot",
        "definition": "A surf spot that breaks on a faraway reef"
    },
    {
        "term": "Neoprene",
        "definition": "An ultra-stretchy rubber made from melted-down petroleum chips used to make wetsuits"
    },
    {
        "term": "Offshore wind",
        "definition": "Wind blowing from the shore out to the ocean, holding the curl line and smoothing the wave face"
    },
    {
        "term": "Onshore wind",
        "definition": "Wind blowing from the ocean toward shore, destroying the quality of waves"
    },
    {
        "term": "Out the back",
        "definition": "An Australian expression for paddling through the breaking waves into the line-up zone"
    },
    {
        "term": "Outline",
        "definition": "The shape of a surfboard from nose to tail"
    },
    {
        "term": "Outside",
        "definition": "The line-up area, as opposed to inside"
    },
    {
        "term": "Over the falls",
        "definition": "A free fall from the top of a wave into the tumbling water cylinder"
    },
    {
        "term": "Paddle battle",
        "definition": "A race between surfers to get into a curl first and thus gain the right of way"
    },
    {
        "term": "Paipo",
        "definition": "A small bellyboard"
    },
    {
        "term": "Party wave",
        "definition": "A wave that is shared and enjoyed by several surfers at the same time"
    },
    {
        "term": "Peak",
        "definition": "The spot in the ocean where the wave breaks for both sides"
    },
    {
        "term": "Pearling",
        "definition": "What happens when a surfer's weight is too far forward, and the surfboard nose dives underwater"
    },
    {
        "term": "Perfect 10",
        "definition": "A perfectly ridden wave in competitive surfing"
    },
    {
        "term": "Pit",
        "definition": "The impact zone of the wave, or the most hollow part of the tube"
    },
    {
        "term": "Pitted",
        "definition": "Tubed, barreled"
    },
    {
        "term": "Polyurethane",
        "definition": "The most common type of material used in surfboard manufacturing"
    },
    {
        "term": "Pop-up",
        "definition": "The quick move a surfer makes to rise to a standing position when taking off on a wave"
    },
    {
        "term": "Priority",
        "definition": "The right of way rule in the surf"
    },
    {
        "term": "Punt",
        "definition": "To perform an aerial maneuver"
    },
    {
        "term": "PWC",
        "definition": "Personal watercraft; a generic term for a jet ski"
    },
    {
        "term": "Quiver",
        "definition": "The number/collection of surfboards owned by a surfer"
    },
    {
        "term": "Rail",
        "definition": "The edge of a surfboard"
    },
    {
        "term": "Rashguard",
        "definition": "A form-fitting shirt made of a nylon-polyester-spandex mixture used under the wetsuit"
    },
    {
        "term": "Reef break",
        "definition": "A wave that breaks over rock or coral"
    },
    {
        "term": "Reflection",
        "definition": "When a wave strikes a hard object and bounces some of its energy off into another direction"
    },
    {
        "term": "Refraction",
        "definition": "The effect by which a swell moving along a point of land slows down where it feels shallow water"
    },
    {
        "term": "Regular foot",
        "definition": "A surfer who rides waves with his left foot forward"
    },
    {
        "term": "Right of way",
        "definition": "The priority given to the surfer closest to the breaking part of the wave"
    },
    {
        "term": "Rip",
        "definition": "To surf very well"
    },
    {
        "term": "Rip current",
        "definition": "A strong surface current of short duration flowing seaward from the shore, also known as riptide"
    },
    {
        "term": "Rocker",
        "definition": "The curve of the surfboard bottom from nose to tail viewed from the side"
    },
    {
        "term": "Rogue wave",
        "definition": "An open ocean wave bigger than the current sea condition"
    },
    {
        "term": "Section",
        "definition": "A part of the wave that breaks ahead of the curl line"
    },
    {
        "term": "Set",
        "definition": "A group of waves"
    },
    {
        "term": "Shacked",
        "definition": "Another expression for getting barreled"
    },
    {
        "term": "Shaka",
        "definition": "A Hawaiian hand gesture used to say 'hello,' 'great,' 'cool,' and 'alright'"
    },
    {
        "term": "Shaper",
        "definition": "A surfboard designer and producer"
    },
    {
        "term": "Shoaling",
        "definition": "The effect by which waves entering shallower water increase in height"
    },
    {
        "term": "Shoulder",
        "definition": "The clean, unbroken, and rideable part of the wave"
    },
    {
        "term": "Shore break",
        "definition": "The area where the ocean waves meet the beach"
    },
    {
        "term": "Shortboard",
        "definition": "A small surfboard"
    },
    {
        "term": "Shred",
        "definition": "To aggressively ride a wave to the fullest"
    },
    {
        "term": "Sick",
        "definition": "Impressive, amazing, crazy"
    },
    {
        "term": "Skagged by the rail",
        "definition": "To be cut by the surfboard fin upon wipeout"
    },
    {
        "term": "Skeg",
        "definition": "An old expression for surfboard fin"
    },
    {
        "term": "Slab",
        "definition": "A heavy reef break coming out of deep water and breaking in very shallow water"
    },
    {
        "term": "Snaking",
        "definition": "The aggressive act of paddling under, around, or over the top of another surfer to get right of way"
    },
    {
        "term": "Soup",
        "definition": "The broken foam of a wave"
    },
    {
        "term": "Stall",
        "definition": "A surfing technique that allows a surfer to slow the speed of the surfboard to let the tube catch up"
    },
    {
        "term": "Stance",
        "definition": "The surfer's feet position on a surfboard"
    },
    {
        "term": "Stick",
        "definition": "A slang for surfboard"
    },
    {
        "term": "Stringer",
        "definition": "The wooden material that runs down the center of the surfboard to give strength and flexibility to the foam"
    },
    {
        "term": "Stoked",
        "definition": "Enthusiastic, exhilarated, or excited"
    },
    {
        "term": "SUP",
        "definition": "Stand-up paddleboard"
    },
    {
        "term": "Surging wave",
        "definition": "A wave that doesn't have time to break because the transition from deep water to shallow water is too fast"
    },
    {
        "term": "Swell",
        "definition": "The energy powered by strong winds that produce wave trains"
    },
    {
        "term": "Take-off",
        "definition": "The start of a wave ride"
    },
    {
        "term": "Thruster",
        "definition": "The three-fin surfboard design created by Simon Anderson"
    },
    {
        "term": "Tidal bore",
        "definition": "A rare phenomenon in which the leading edge of the incoming tide forms a wave that travels up a river"
    },
    {
        "term": "Tow-in",
        "definition": "When surfers use personal watercraft to tow into waves that can't be paddled into"
    },
    {
        "term": "Trimming",
        "definition": "Finding the perfect surf line for speed on the wave face"
    },
    {
        "term": "Trough",
        "definition": "The bottom of the wave, the opposite of a crest"
    },
    {
        "term": "Tsunami",
        "definition": "A giant and deadly wave"
    },
    {
        "term": "Tube",
        "definition": "The hollow interior of a wave, also known as barrel"
    },
    {
        "term": "Turtle roll",
        "definition": "A surfing technique where the surfer flips the board over in front of an oncoming wave to get under it"
    },
    {
        "term": "Twin-fin",
        "definition": "A surfboard with two fins"
    },
    {
        "term": "Wahine",
        "definition": "A female surfer"
    },
    {
        "term": "Wave height",
        "definition": "The difference between the elevations of a crest and a neighboring trough"
    },
    {
        "term": "Wave period",
        "definition": "The time between two consecutive wave crests"
    },
    {
        "term": "Wave train",
        "definition": "A group of swells of similar wavelengths"
    },
    {
        "term": "Wavelength",
        "definition": "The distance between the crest of one wave to the crest of the next wave"
    },
    {
        "term": "Wax",
        "definition": "A paraffin-based product that is applied to the surfboard deck to increase traction and reduce slippery"
    },
    {
        "term": "Wedge",
        "definition": "A steep wave"
    },
    {
        "term": "Wetsuit",
        "definition": "A garment made of neoprene that provides thermal insulation"
    },
    {
        "term": "Whitewater",
        "definition": "The foamy, white-colored water created where a wave breaks"
    },
    {
        "term": "Windswell",
        "definition": "A group of waves generated by local winds within less than 800 miles from the coast"
    }
]
